*This notebook contains an excerpt from the [Python Data Science Handbook](http://shop.oreilly.com/product/0636920034919.do) by Jake VanderPlas; the content is available [on GitHub](https://github.com/jakevdp/PythonDataScienceHandbook).*

# Operating on Data in Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int32

In [3]:
s1 = pd.Series(rng.randint(0, 10, 4))
s2 = pd.Series(rng.randint(0, 10, 4))

In [4]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                  columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  7  2  5  4
1  1  7  5  1
2  4  0  9  5

In [5]:
df1 = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                  columns=['A', 'B', 'C', 'D'])
df2 = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                  columns=['A', 'B', 'C', 'D'])

In [6]:
v1 = 1
v2 = 3

In [7]:
v1 + v2

4

In [8]:
s1

0    6
1    9
2    2
3    6
dtype: int32

In [9]:
v1 + s1

0     7
1    10
2     3
3     7
dtype: int32

In [10]:
df1

   A  B  C  D
0  8  0  9  2
1  6  3  8  2
2  4  2  6  4

In [11]:
v1 + df1

   A  B   C  D
0  9  1  10  3
1  7  4   9  3
2  5  3   7  5

In [12]:
s1

0    6
1    9
2    2
3    6
dtype: int32

In [13]:
s2

0    7
1    4
2    3
3    7
dtype: int32

In [15]:
s1[4] = 10

In [16]:
s1

0     6
1     9
2     2
3     6
4    10
dtype: int64

In [17]:
s2

0    7
1    4
2    3
3    7
dtype: int32

In [18]:
s1 + s2

0    13.0
1    13.0
2     5.0
3    13.0
4     NaN
dtype: float64

In [19]:
s2[-1] = 33

In [20]:
s1

0     6
1     9
2     2
3     6
4    10
dtype: int64

In [21]:
s2

 0     7
 1     4
 2     3
 3     7
-1    33
dtype: int64

In [22]:
s1 + s2

-1     NaN
 0    13.0
 1    13.0
 2     5.0
 3    13.0
 4     NaN
dtype: float64

In [24]:
df1

   A  B  C  D
0  8  0  9  2
1  6  3  8  2
2  4  2  6  4

In [25]:
df2

   A  B  C  D
0  8  6  1  3
1  8  1  9  8
2  9  4  1  3

In [26]:
df1 + df2

    A  B   C   D
0  16  6  10   5
1  14  4  17  10
2  13  6   7   7

In [28]:
df1['E'] = 44
df1

   A  B  C  D   E
0  8  0  9  2  44
1  6  3  8  2  44
2  4  2  6  4  44

In [30]:
df2.at[3] = [33,33,33,33]
df2

      A     B     C     D
0   8.0   6.0   1.0   3.0
1   8.0   1.0   9.0   8.0
2   9.0   4.0   1.0   3.0
3  33.0  33.0  33.0  33.0

In [31]:
df1 + df2

      A    B     C     D   E
0  16.0  6.0  10.0   5.0 NaN
1  14.0  4.0  17.0  10.0 NaN
2  13.0  6.0   7.0   7.0 NaN
3   NaN  NaN   NaN   NaN NaN

In [33]:
df

   A  B  C  D
0  7  2  5  4
1  1  7  5  1
2  4  0  9  5

In [36]:
s = df['A']
s

0    7
1    1
2    4
Name: A, dtype: int32

In [41]:
#(df.T + s).T

In [43]:
df.add(s, axis='index')

    A  B   C   D
0  14  9  12  11
1   2  8   6   2
2   8  4  13   9

In [37]:
df + s

    A   B   C   D   0   1   2
0 NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN

In [4]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [5]:
np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

## Index Alignment

For binary operations on two ``Series`` or ``DataFrame`` objects, Pandas will align indices in the process of performing the operation.
This is very convenient when working with incomplete data, as we'll see in some of the examples that follow.

### Index alignment in Series

As an example, suppose we are combining two different data sources, and find only the top three US states by *area* and the top three US states by *population*:

In [6]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')

In [7]:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

The resulting array contains the *union* of indices of the two input arrays, which could be determined using standard Python set arithmetic on these indices:

In [8]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [9]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [10]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

### Index alignment in DataFrame

A similar type of alignment takes place for *both* columns and indices when performing operations on ``DataFrame``s:

In [18]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list('AB'))
A

    A   B
0  19   2
1   4  18

In [12]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                 columns=list('BAC'))
B

   B  A  C
0  4  0  9
1  5  8  0
2  9  2  6

In [13]:
A + B

      A     B   C
0   1.0  15.0 NaN
1  13.0   6.0 NaN
2   NaN   NaN NaN

In [14]:
fill = A.stack().mean()
A.add(B, fill_value=fill)

      A     B     C
0   1.0  15.0  13.5
1  13.0   6.0   4.5
2   6.5  13.5  10.5

The following table lists Python operators and their equivalent Pandas object methods:

| Python Operator | Pandas Method(s)                      |
|-----------------|---------------------------------------|
| ``+``           | ``add()``                             |
| ``-``           | ``sub()``, ``subtract()``             |
| ``*``           | ``mul()``, ``multiply()``             |
| ``/``           | ``truediv()``, ``div()``, ``divide()``|
| ``//``          | ``floordiv()``                        |
| ``%``           | ``mod()``                             |
| ``**``          | ``pow()``                             |

## Operations Between DataFrame and Series

When performing operations between a ``DataFrame`` and a ``Series``, the index and column alignment is similarly maintained.
Operations between a ``DataFrame`` and a ``Series`` are similar to operations between a two-dimensional and one-dimensional NumPy array.
Consider one common operation, where we find the difference of a two-dimensional array and one of its rows:

In [26]:
df = pd.DataFrame(rng.randint(0, 10, (2, 4)), columns=list('QRST'))
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -5  0  0 -5

If you would instead like to operate column-wise, you can use the object methods mentioned earlier, while specifying the ``axis`` keyword:

In [27]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0  7  0  7  7
1  2  0  7  2

Note that these ``DataFrame``/``Series`` operations, like the operations discussed above, will automatically align  indices between the two elements:

In [28]:
halfrow = df.iloc[0, ::2]
halfrow

Q    7
S    7
Name: 0, dtype: int64

In [29]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -5.0 NaN  0.0 NaN

In [45]:
s = pd.Series(['Atlanta', 'Tallahassee', 'Austin'], index=['GA', 'FL', 'TX'])
s

GA        Atlanta
FL    Tallahassee
TX         Austin
dtype: object

In [46]:
str1 = 'Atlanta'
len(str1)

7

In [47]:
len(s)

3

In [ ]:
l = []
for v in s:
    l.append(len(v))
l
s2 = pd.Series(l, index=s.index)
s2

In [56]:
s.apply(len)

GA     7
FL    11
TX     6
dtype: int64

In [57]:
s[['GA', 'FL']].apply(len)

GA     7
FL    11
dtype: int64

In [59]:
s.apply(lambda x: x[::-1])

GA        atnaltA
FL    eessahallaT
TX         nitsuA
dtype: object